{

"Ann Marie Yuu":
[
        {
            "name": "Combat Low",
            "level": 4,
            "description": "WIS save or else 3 stacks of atrophy",
            "range": "30ft",
            "casting_time": "1 Bonus Action",
            "charges": 3
        },
        {
            "name": "By Your Side",
            "level": 8,
            "description": "Up to 5 PC allies of choice in range (may include self), get a combined 30 shield HP. This overrides all other form of shield.",
            "range": "30ft",
            "casting_time": "1 Bonus Action",
            "charges": 1           
        },
        {
            "name": "Ice Angel",
            "level": 12,
            "description": "When dealing damage to an enemy, convert the rolled damage to shield HP for a willing ally within range (Max 30). This shield overrides other sources of shield HP.",
            "range": "30ft",
            "casting_time": "1 Reaction",
            "charges": 4
        },
        {
            "name": "",
            "level": 16,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        },
        {
            "name": "",
            "level": 20,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        }
    

        ],

"Lunatique Pianoforte":
[
        {
            "name": "Song of Strength - Absoulte Soul",
            "level": 4,
            "description": "Stronger version of Radiant Soul. Upon activation, gain +1 to all ability scores. Healing Hands turns into Healing Word of the highest unlocked spellslot. Gain 3 Bardic Inspiration dice. Lasts for 1 minute.",
            "range": "Self",
            "casting_time": "1 Bonus Action",
            "charges": 1
        },
        {
            "name": "Song of Inspiration - Asterlore",
            "level": 8,
            "description": "In combat, Luna always has Bardic Inspiration available. Once granted to an ally, their Crit threshold is lowered by the amount of uses they have remaining.",
            "range": "30ft",
            "casting_time": "Passive",
            "charges": "Passive"         
        },
        {
            "name": "Song of Resilience - Choir Jail",
            "level": 12,
            "description": "Shackle a creature for 1 turn. While active, Luna cannot move and take or deal damage. When Luna is knocked, she can set her HP to 1 and activate the ability on the creature that last dealt damage to her.",
            "range": "30ft",
            "casting_time": "1 Bonus Action/Instant",
            "charges": 1
        },
        {
            "name": "",
            "level": 16,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        },
        {
            "name": "",
            "level": 20,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        }
    

        ],     
    
"Chiara Aurelius":
[
        {
            "name": "Intemperance",
            "level": 4,
            "description": "Spend 30 gold to regain 1 sorcery point as a free action, up to 4 times a turn. Up to the user's maximum amount of sorcery points can be recovered in this way. Gain 10 gold per unspent sorcery point on a long rest.",
            "range": "Self",
            "casting_time": "1 Bonus Action",
            "charges": "Until Broke"
        },
        {
            "name": "Lustrous Veil",
            "level": 8,
            "description": "Whenever Armor of Agathys is cast, spend up to 5 sorcery points to enhance the barrier it forms, with each sorcery point spent granting incremental bonuses.\n**(2 sorcery points)** Armor of Agathys' damage reflection now triggers on damage from ranged attacks.\n**(3 sorcery points)** Armor of Agathys' damage reflection now triggers on damage from ranged attacks. Additionally, gain advantage on concentration saves while shielded.\n**(4 sorcery points)** Armor of Agathys' damage reflection now triggers on damage from ranged attacks. Additionally, gain advantage on concentration saves while shielded. While shielded by Armor of Agathys, gain resistance to all forms of damage except true damage.\n**(5 sorcery points)** Armor of Agathys' damage reflection now triggers on damage from ranged attacks. \nAdditionally, gain advantage on concentration saves while shielded. While shielded by Armor of Agathys, gain resistance to all forms of damage except true damage. Damage is further decreased by 1d6 after resistances. Damage dealt by Armor of Agathys ignores resistances.",
            "range": "Self",
            "casting_time": "Instant",
            "charges": 12         
        },
        {
            "name": "Unearned Envy",
            "level": 12,
            "description": "Spend 2 sorcery points to imbue the spell with Chiara's teasing and other traces of psychic energy, making it deal **2d6 extra psychic damage** in addition to the spell's base damage on initial hit. When a creature takes damage from this spell on initial hit, they must roll a **WIS save (DC 17)** or be inflicted with 3 stacks of Temptation. On a pass, they gain only 1 stack of Temptation and do not take any of the bonus psychic damage.",
            "range": "Self",
            "casting_time": "Instant",
            "charges": 12
        },
        {
            "name": "",
            "level": 16,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        },
        {
            "name": "",
            "level": 20,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        }
    

        ],

"Sienna Sleep":
[
        {
            "name": "Down the Rabbit Hole",
            "level": 4,
            "description": "At the start of her turn, Sienna delves into a shadowy pool, becoming invulnerable and invisible to other creatures.\nWhile concealed, Sienna can only use movement, and she can climb on walls and ceilings.\nSienna can choose to emerge from the surface at any time at the start of her next turn.",
            "range": "Self",
            "casting_time": "1 Action",
            "charges": 3
        },
        {
            "name": "It's My Own Invention",
            "level": 8,
            "description": "Spawns either Aletheia or Iris as a shadow (or both at the same time) within 30 ft. \nAll shadows are completely identical and linked to Sienna's game statistics.\n*((Basically we all share HP and the same action economy)*\nIf Sienna becomes unconscious, the shadows all disappear. You can dismiss a shadow any time at will.",
            "range": "Self",
            "casting_time": "Instant",
            "charges": 2         
        },
        {
            "name": "Looking Glass Insects",
            "level": 12,
            "description": "Spawns an insect with 1 HP that is a copy of Sienna (can appear shapeshifted too).\nChoose a number of creatures that can see the insect. All creatures that can see the insect are completely oblivious to Sienna (and clones).\nThe affected creatures do not notice that their attention is shifted to the insect.\nThe insect only lasts for 1 minute. This can only be used once per short rest.",
            "range": "Self",
            "casting_time": "Instant",
            "charges": 1
        },
        {
            "name": "",
            "level": 16,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        },
        {
            "name": "",
            "level": 20,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        }


        ],

"Val Akeldama":
[
        {
            "name": "The Sufferer and The Witness",
            "level": 4,
            "description": "Lingering fragments of Anas Void Prison circulate in Vals body, working similarly to adrenaline.\n- Exhaustion 1: Gain disadvantage on ability checks, but critical failure threshold of creatures making a save against him increases by 1.\n- Exhaustion 2: Speed is halved, but Val can hover up to a maximum of 5ft.\n- Exhaustion 3: Gain disadvantage on attack rolls and saving throws, but a single die decides the resulting damage of a spell. For example, Val rolls a d8 for Psionic Blast. If he rolls a 3, all five d8 dice are replaced with 3. If two different dice are rolled, for example Chaos Bolt's 2d8 and 1d6, these dice have to be rolled separately.\n- Exhaustion 4: Max HP is halved, but one successful death save revives him. Failed death saves do not reset.\n- Exhaustion 5: Speed is reduced to 0. All his spells become quickened spells.\n- Exhaustion 6: Val is healed to full HP, but his max HP is halved. This can only occur once.\n- Exhaustion 7: Deal 3000% of HP as damage to self. Deal 3000% of an enemy's HP as true damage to everything within a 10ft radius.",
            "range": "Self",
            "casting_time": "",
            "charges": ""
        },
        {
            "name": "Realign",
            "level": 8,
            "description": "As a bonus action, Val can force a wild magic roll with an extra die for 1 sorcery point.\nHe can also instead induce a wild magic roll to a target within 30ft. If the target is unwilling, roll a d6. The number it lands on is the save the target has to make.\nAdditional wild magic dice can be rolled by using more sorcery points. The cost of extra dice increases exponentially.",
            "range": "Self",
            "casting_time": "Bonus Action",
            "charges": ""         
        },
        {
            "name": "Divine Inner Tension",
            "level": 12,
            "description": "As a bonus action, Val can tap into his boundless and unstable pool of magic to attempt casting a spell he knows.\nUtilizing two sorcery points, roll 3d4. If the results are a bust, roll for Wild Magic.\nIf two numbers match, cast a spell (i.e. results are 3, 2, 2 — cast a 2nd level spell; results are 3, 3, 1 — cast a 3rd level spell).\nIf three numbers match, cast a stronger spell (i.e. 1, 1, 1 == 5th level spell; 4, 4, 4 == 8th level spell).\nSpells cast in this manner can be saved for later use, costing a bonus action. If the roll resulted in another spell, then the older spell can be kept or overwritten.",
            "range": "",
            "casting_time": "Bonus Action",
            "charges": ""
        },
        {
            "name": "",
            "level": 16,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        },
        {
            "name": "",
            "level": 20,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        }

        
        ],
        
"Asano Tenki":
[
        {
            "name": "TENKICHI Oxygen",
            "level": 4,
            "description": "As a bonus action, Tenki ensnares a target within 60 feet (+10 to hit), dealing 3d6+3 bludgeoning damage on hit.\nOn a hit, she can choose to either drag the target to her, or propel herself towards the target.\n- Breathe In~!: Tenki attempts to pull the target into an unoccupied space 5 feet adjacent to her. The target must pass a STR check (DC 17) or be pulled into the adjacent space of Tenki's choice. Large or bigger creatures automatically pass this check.\n- Breathe Out~!: Tenki immediately blinks to an unoccupied space 5 feet adjacent to the target. This movement does not provoke opportunity attacks, and counts as movement towards an enemy for purposes of passives such as Rakish Audacity.\nTenki has 3 charges of this ability. She regains 1 charge on a short rest, and all charges on a long rest.\nAdditionally, she can use this ability out of combat to grapple onto surfaces and objects. Using this ability in this way does not expend any charges.",
            "range": "60ft",
            "casting_time": "Bonus Action",
            "charges": 3
        },
        {
            "name": "TENKICHI Echo",
            "level": 8,
            "description": "Tenki conjures a sound gun called Saint's Row, which she can tune to one of the three settings for a single attack (+10 to hit, save DC 17)\n- Freedom Dive: Tenki aims at the target and plays loud, disorienting music, dealing 2d8+DEX thunder damage. If it hits, the target must roll a CON save (DC 17). Upon failure, they have disadvantage on saves and attack rolls for 2 turns. Creatures that are deafened automatically fail this.\n- Glorious Crown: Tenki cranks up the gun's bass and sets it on the ground facing down. 15ft. sphere starting from self range, all creatures must roll CON save (DC 17). On a fail, they take 3d6 bludgeoning damage and are knocked prone. The affected radius becomes difficult terrain. Half damage on success.\n- Heavenly Blast: Tenki aims the gun above her and fires.  20ft. sphere radius starting from self range, all enemies must make a WIS save (DC 17). Enemies that fail get Frightened for 2 turns, and creatures have advantages on attack rolls against them. Do nothing on success. Creatures that are deafened automatically fail this.\nTenki has 2 charges per long rest of this ability.",
            "range": "",
            "casting_time": "Instant",
            "charges": 2         
        },
        {
            "name": "TENKICHI Prism",
            "level": 12,
            "description": "[This ability counts as Spell Concentration]. Tenki summons a clone within 30ft of her.\nThis clone has half of Tenki's total HP, and shares initiative and actions with her.\nThe clone is able to proc sneak attack the same way as Tenki does but only dealing half the damage dice (6d6, turned to 3d6).\nThis clone has the ability to self destruct (free action) [DEX save DC 17] dealing 3d10 thunder damage to everyone within 20ft.\nThe damage decreases by 1 die for every 2 turns the clone has lasted starting from the end of Tenki's next turn (minimum of 1d10).\n* Save DC calculation: 8+DEX modifier+Proficiency modifier*",
            "range": "30ft",
            "casting_time": "Instant",
            "charges": 1
        },
        {
            "name": "",
            "level": 16,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        },
        {
            "name": "",
            "level": 20,
            "description": "",
            "range": "",
            "casting_time": "",
            "charges": 3
        }


        ],

}